In [235]:
import pandas as pd


df = pd.DataFrame({'num_legs': [2, 4, 8, 0],
                    'num_wings': [2, 0, 0, 0],
                    'num_specimen_seen': [10, 2, 1, 8]},
                   index=['falcon', 'dog', 'spider', 'fish'])
df

        num_legs  num_wings  num_specimen_seen
falcon         2          2                 10
dog            4          0                  2
spider         8          0                  1
fish           0          0                  8

In [236]:
df3 = pd.DataFrame({'y1111': [2, 4, 8, 0]}, index=['falcon', 'dog', 'spider', 'fish'])

df[df3.columns] = df3

# df4 = [df, df3]
df

        num_legs  num_wings  num_specimen_seen  y1111
falcon         2          2                 10      2
dog            4          0                  2      4
spider         8          0                  1      8
fish           0          0                  8      0

In [237]:
df2 = df.sample(frac=1, random_state=5)
df2

        num_legs  num_wings  num_specimen_seen  y1111
falcon         2          2                 10      2
dog            4          0                  2      4
spider         8          0                  1      8
fish           0          0                  8      0

In [238]:
df2[2:]

        num_legs  num_wings  num_specimen_seen  y1111
spider         8          0                  1      8
fish           0          0                  8      0

In [239]:
df2[:2]

        num_legs  num_wings  num_specimen_seen  y1111
falcon         2          2                 10      2
dog            4          0                  2      4

In [240]:
import numpy as np

classification_result = np.zeros(shape=(1,3))
# classification_result

print(classification_result[0][1])

0.0

In [241]:
import pandas as pd

df = pd.DataFrame({'A': [4, 5, 6]})
print(df)

print(df.nunique().values)

if df.nunique().values >= 2:
    print('yes')
else:
    print('no')

   A
0  4
1  5
2  6
[3]
yes

In [242]:
import pandas as pd

data = [[10, 20, 0], [10, 10, 10], [10, 20, 30]]

print(data)

[[10, 20, 0], [10, 10, 10], [10, 20, 30]]